#include "TransportTask.h"

int main() {
    srand(static_cast<unsigned int>(time(nullptr)));

    int numberOfBatteries, numberOfWarehouses;
    cout << "Введіть кількість батарей : ";
    cin >> numberOfBatteries;
    cout << "Введіть кількість складів : ";
    cin >> numberOfWarehouses;

    TransportTask tt(numberOfBatteries, numberOfWarehouses);
    tt.Start();

    return 0;
}
/*
Сформуйте простір імен, який міститиме такі поля: три
числових поля, два вектори чисел, три матриці чисел.
Задайте з клавіатури кількість батарей, які потребують
снарядів і кількість складів, де їх можна отримати.
Після цього сформуйте вектори потреб і запасів відповідних
розмірів, виведіть їх на екран. І порівняйте їх між собою.
Залежно від цього завдання матиме варіанти розв’язку.
Потім сформуйте матрицю цін перевезення однієї штуки з
кожного складу до кожної батареї і виведіть її на екран.
При бажанні усі значення можна задати випадковим чином.
Приклад даних можна знайти за адресою.
Вам потрібно визначити і вивести на екран для кожної батареї
кількість снарядів, які можна завезти з того чи іншого складу
таким чином, щоб вартість перевезення була мінімальна. Це
буде матриця перевезень.
Наприклад:
100 0 40 0 250
0 0 10 0 0
0 0 0 200 0
0 150 0 0 0
Потім перемножте матрицю перевезень на матрицю цін і
отримайте матрицю вартостей і виведіть на екран.
Наприклад:
500 0 80 0 750
0 0 10 0 0
0 0 0 600 0
0 750 0 0 0
Потім знайдіть суму всіх її значень і виведіть її на екран.
*/